In [2]:
import pandas as pd

df = pd.DataFrame({
    'id': ['English', 'English', 'Math', 'Math', 'Science'],
    'student': ['Song', 'Song', 'Trump', 'Trump', 'Biden']
})

df

        id student
0  English    Song
1  English    Song
2     Math   Trump
3     Math   Trump
4  Science   Biden

<h1>drop_duplicates() removes duplicated rows from a dataframe</h1>

<h4>parameters:</h4>
<h4>
    <ol>
        <li>subset: (Optional) A column label or list of column labels to consider for identifying duplicates. If None (default), all columns are used</li>
        <li>keep: 'first'/ 'last' / False - Default is 'first'</li>
        <li>inplace: (Optional) A boolean, default False</li>
        <li>ignore_index: (Optional) A boolean, default False</li>
    </ol>
</h4>

In [16]:
df.drop_duplicates()

        id student
0  English    Song
2     Math   Trump
4  Science   Biden

In [17]:
df.drop_duplicates(subset=['id', 'student'], ignore_index=True)

        id student
0  English    Song
1     Math   Trump
2  Science   Biden